<template lang="pug">
pre 
  - Доступные кадровые события настраиваются индивидуально под вашу компанию
  У вас нет необходимости в доступе сотрудников к расчетным листкам? В вашей компании не принято составлять график отпусков на год?
  Все это конфигурируется при первоначальной настройке приложения, а в последствии, при необходимости, можно включить недостающую функциональность.


  - Брендирование приложения под вашу компанию
  
  - Интеграция в ИТ-периметр компании
</template>
<script setup lang="ts"></script>