<template lang="pug">
h1.text-center КЭДО для директора по персоналу
.row
  .col
    q-img(src='/block-hero.png')
  .col
    .column
      .col.text-h4.text-center Снижение стоимости кадровой функции
      .col 
        p  kedo-team автоматизирует кадровые бизнес-процессы целиком. 
          | Все взаимодействия между сотрудниками и кадровой службы проходят через цифровые интерфейсы. Это существенно увеличивает эффективность каждого кадровика.

h6 КЭДО &ndash; неотъемлимая составляющая вашего HR-бренда
p kedo-team существенно повышает у ваших сотрудников ощущения работы в высокотехнологичной компании. Классические отделы кадров давно уже ушли в прошлое и выглядят рундиментами.

h6 КЭДО улучшает эффективность сотрудников кадровой службы
p Сотрудники кадровой службы &ndash; ваши бесценные эксперты. Время, которое они тратили на рутинный поток обработки бумажных заявлений на отпуска, командировки и пр. высвободится на экспертные консультации.


ul
  li 
  li 

</template>
<script setup lang="ts">
</script>