<template lang="pug">
q-splitter(v-model='splitterModel')
  template(#before)
    .q-pa-md.q-gutter-sm
      q-input(label='Поиск...')
      q-list(bordered separator)
        q-item(v-for='cert in certList'
              clickable)
          q-item-section
            q-item-label {{ cert.title }}
            q-item-label(caption) {{ cert.shortDescription }}
  template(#after)
    .column.q-gutter-y-md
      .q-pa-md Сведения, которые надо указать в справке с места работы, называет сам работник. Это могут быть:       | справка о зарплате;
        | о персонифицированном учете и стаже;
        | о характере и условиях труда по основному месту работы;
        | о том, что работник не пользуется определенными видами льгот;
        | другие
      .row.justify-end
        q-btn(color="purple"
              @click='confirmDialog=true') Отправить заявку
      .row.text-h5.justify-center Образец
      q-img(src='certificates/sample.jpg')
        template(#error)
          .absolute-full.flex.flex-center.bg-negative.text-kedo-white
          | Ошибка при загрузке образца


</template>

<style scoped lang="scss">
</style>

<script setup lang="ts">
import { ref } from 'vue'
const active = ref(true)
const splitterModel = ref (50);

const certList = [
  {
    title: 'О зарплате',
    shortDescription: 'Содержит сведения о зарплате',
    detailDescription: `Сведения, которые надо указать в справке с места работы, называет сам работник. Это могут быть:
справка о зарплате;
о персонифицированном учете и стаже;
о характере и условиях труда по основному месту работы;
о том, что работник не пользуется определенными видами льгот;
другие`,
  },
  {
    title: 'О персонифицированном учете',
    shortDescription: 'Содержит сведения о зарплате',
  },
  {
    title: 'О характере и условиях труда по основному месту работы',
    shortDescription: 'Содержит сведения о зарплате',
  },
  {
    title: 'О том, что работник не пользуются льготами',
    shortDescription: 'Содержит сведения о зарплате',
  }
];
// const certList = [
//     {
//         title: 'Справка с работы о зарплате № 182',
//         shortDescription: 'Содержит сведения о зарплате',
//         detailDescription: `Сведения, которые надо указать в справке с места работы, называет сам работник. Это могут быть:
// справка о зарплате;
// о персонифицированном учете и стаже;
// о характере и условиях труда по основному месту работы;
// о том, что работник не пользуется определенными видами льгот;
// другие`,
//         imgUrl: ''
//     },
//     {
//         title: 'Справка с работы о зарплате № 182',
//         shortDescription: 'Содержит сведения о зарплате',
//         detailDescription: `Сведения, которые надо указать в справке с места работы, называет сам работник. Это могут быть:
// справка о зарплате;
// о персонифицированном учете и стаже;
// о характере и условиях труда по основному месту работы;
// о том, что работник не пользуется определенными видами льгот;
// другие`,
//         imgUrl: ''
//     },
//         {
//         title: 'Справка с работы о зарплате № 182',
//         shortDescription: 'Содержит сведения о зарплате',
//         detailDescription: `Сведения, которые надо указать в справке с места работы, называет сам работник. Это могут быть:
// справка о зарплате;
// о персонифицированном учете и стаже;
// о характере и условиях труда по основному месту работы;
// о том, что работник не пользуется определенными видами льгот;
// другие`,
//         imgUrl: ''
//     }
// ];

</script>
